/**
  ******************************************************************************
  * @file			bsp_beep.c
  * @brief			bsp_beep function
  * @author			Xli
  * @email			xieliyzh@163.com
  * @version		1.0.0
  * @date			2020-02-06
  * @copyright		2020, XIELI Co.,Ltd. All rights reserved
  ******************************************************************************
**/

/* Includes ------------------------------------------------------------------*/
#include "bsp_beep.h"

/* Private constants ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function ----------------------------------------------------------*/

/**=============================================================================
 * @brief           蜂鸣器初始化
 *
 * @param[in]       none
 *
 * @return          none
 *============================================================================*/
void bsp_beep_init(void)
{
    /* 初始化IO复用 */
    IOMUXC_SetPinMux(IOMUXC_SNVS_SNVS_TAMPER1_GPIO5_IO01, 0);

    /* 配置GPIO5_IO1的IO属性 */
    IOMUXC_SetPinConfig(IOMUXC_SNVS_SNVS_TAMPER1_GPIO5_IO01, 0x10B0);

    /* 设置GPIO5_IO01为输出 */
    GPIO5->GDIR |= (1<<1);

    /* 设置GPIO5_IO01输出高电平 */
    GPIO5->DR |= (1<<1);
}

/**=============================================================================
 * @brief           蜂鸣器开关
 *
 * @param[in]       none
 *
 * @return          none
 *============================================================================*/
void bsp_beep_switch(uint8_t status)
{
    if (status)
    {
        GPIO5->DR &= ~(1<<1);
    }
    else
    {
        GPIO5->DR |= (1<<1);
    }
}